; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 448164 1 3 4 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	image3 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star2 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(have_image Planet4 thermograph0)
	(have_image Planet5 image3)
	(have_image Phenomenon6 thermograph2)
	(have_image Phenomenon7 thermograph2)
))

)

; plan
1. (turn_to satellite0 star2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star2)
   goals met: 0 of 4
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
3. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 4
4. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 0 of 4
5. (turn_to satellite0 phenomenon7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 4
6. (take_image satellite0 phenomenon7 instrument1 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 1 of 4
7. (turn_to satellite0 planet5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet5)
   goals met: 1 of 4
8. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 4
9. (take_image satellite0 phenomenon6 instrument1 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 2 of 4
10. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 4
11. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   goals met: 2 of 4
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 4
13. (turn_to satellite0 groundstation3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 4
14. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 2 of 4
15. (turn_to satellite0 planet5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet5)
   goals met: 2 of 4
16. (take_image satellite0 planet5 instrument0 image3)
   added: (have_image planet5 image3)
   goals met: 3 of 4
17. (turn_to satellite0 planet4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet4)
   goals met: 3 of 4
18. (take_image satellite0 planet4 instrument0 thermograph0)
   added: (have_image planet4 thermograph0)
   goals met: 4 of 4
